Revit 2024 API
AirSystemData.HeatingCoilType Property
 The heating coil type. Note this property change would reset the heating water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public AirHeatingCoilType HeatingCoilType { get; set; }
Visual Basic
Public Property HeatingCoilType As AirHeatingCoilType
	Get
	Set
Visual C++
public:
property AirHeatingCoilType HeatingCoilType {
	AirHeatingCoilType get ();
	void set (AirHeatingCoilType value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace